//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//
//int main()//知识点：有符号无符号和整型提升
//{
//	char a=-1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 //整型数字的存放：1、正数存放时由于三码相同直接存放余（类型变量）所开辟的空间。2、负数存放时在存放之前都需转换成补码（不管类型是有符号还是无符号的都需 先转换再存储 ），再存内（类型变量）所开辟的空间中。
//	//11111111
//	signed char b=-1;
//	//11111111
//	unsigned char c=-1;
//	//11111111
//	printf("a=%d,b=%d,c=%d",a,b,c);//打印是以原码的形式打印的
//	//char或short以整型的形式进行打印都需要进行整型提升， 有符号数左边补符号位，无符号数左边直接补0，补至一个普通整型为止。整型提升之后在进行再转为源码打印
//	return 0;
//}