#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>




////匿名结构体类型（无结构体标签）
//
//
//struct
//{
//	int a;
//	char c;
//}sa;
//
//struct 
//{
//	int a;
//	char c;
//}*psa;
//
//int main()
//{
//	psa=&sa;//匿名的结构体指针是不能接收匿名结构体变量的地址的，即便他们结构体成员一样；因为编译器会判断它们类型不兼容
//
//}

//*****************************************************************************************************************************

//结构体的自引用

//struct Node//结构体自己包含自己是不允许的，因为大小没法计算
//{
//	int data;
//	struct Node next;
//
//};


//struct Node//结构体内包含一个结构体指针是可以的（似链表，一个是数值域，一个是指针域(存下一个数值的地址)）----正确的自引用方式
//{
//	int data;
//	struct Node*next;
//
//
//};


//*****************************************************************************************************************************

//结构体的内存对齐

//结构体未嵌套结构体的结构体内存对齐
//struct S1
//{
//	char c1;
//	int a;
//	char c2;
//
//};
//
//
//int main()
//{
//	struct S1 s1={0};
//	printf("%d\n",sizeof(s1));
//
//
//}




//结构体嵌套结构体的结构体内存对齐

//struct S3
//{
//	double d;
//	char c;
//	int i;
//};
//
//
//struct S4
//{
//	char c1;
//	struct S3 s3;
//	double d;
//};
//
//
//int main ()
//{
//	printf("%d\n",sizeof(struct S3));//16
//	printf("%d\n",sizeof(struct S4));
//
//
//}


//*****************************************************************************************************************************

//位段//节省空间


//struct S
//{
//	int a:2;
//	int b:5;
//	int c:10;
//	int d:30;
//};
//
//
//int main()
//{
//	struct S s;
//	printf("%d\n",sizeof(s));//8个字节
//	return 0;
//}



//struct S
//{
//	char a:3;
//	char b:4;
//	char c:5;
//	char d:4;
//};
//
//
//int main()
//{
//	struct S s={0};
//	s.a=10;
//	s.b=20;
//	s.c=3;
//	s.d=4;
//	return 0;
//
//}


//*****************************************************************************************************************************
//枚举//一一列举

//枚举类型
//enum Sxe
//{
//	//枚举的可能取值--常量
//	MALE,//0               //一一列举以“，”隔开
//	FEMALE,//1
//	SECERT//2               //每一个列举的常量都有对应的值,也可以对这个默认的对应值进行修改
//
//	//MALE=5//5                                                                                                       
//	//FEMALE,//6
//	//SECERT//7
//
//};
//
//
//int main()
//{
//	enum Sxe s=FEMALE;
//	return 0;
//
//
//}



//*****************************************************************************************************************************
////用联合体判断当前机器的大小端存储模式
//
//int check()
//{
//	union Un
//	{
//		char c;
//		int i;
//	}u;//共用四个字节（从前到后共用所以c和i的地址和联合体变量的地址一样）
//	u.i=1;
//	return u.c;//c是int四个字节中第一个字节（因为是共用体）
//
//
//}
//
//
//int main()
//{
//	int ret;
//	ret=check();
//	if(ret==1)
//	{
//		printf("小端\n");
//
//	}
//	else
//		printf("大端\n");
//
//
//
//	return 0;
//}


//联合体的大小计算
//union Un
//{
//	int a;//4 |8   4
//	char arr[5];//5  1|8   1  //数组的对齐数是根据数组的元素来计算的
//
//
//};//联合体大小为8